In [7]:
!pip install pandas --upgrade

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/31/b4/38aa707d65f0e051abac7845280557919f4be77a8b5b1bd7e42ecd90ca6b/pandas-0.22.0-cp36-cp36m-macosx_10_6_intel.macosx_10_9_intel.macosx_10_9_x86_64.macosx_10_10_intel.macosx_10_10_x86_64.whl (14.9MB)
    100% |████████████████████████████████| 14.9MB 299kB/s ta 0:00:01   26% |████████▍                       | 3.9MB 234kB/s eta 0:00:47    95% |██████████████████████████████▋ | 14.3MB 1.9MB/s eta 0:00:01
Requirement not upgraded as not directly required: python-dateutil>=2 in /Users/kishan/anaconda3/lib/python3.6/site-packages (from pandas) (2.6.1)
Requirement not upgraded as not directly required: pytz>=2011k in /Users/kishan/anaconda3/lib/python3.6/site-packages (from pandas) (2018.3)
Requirement not upgraded as not directly required: numpy>=1.9.0 in /Users/kishan/anaconda3/lib/python3.6/site-packages (from pandas) (1.14.2)
Requirement not upgraded as not directly required: six>=1.5 in /Users/kishan/anaconda3/lib/python3.6/site-packages (from python-dateutil>=2->pandas) (1.11.0)
Installing collected packages: pandas
  Found existing installation: pandas 0.20.3
    Uninstalling pandas-0.20.3:
      Successfully uninstalled pandas-0.20.3
Successfully installed pandas-0.22.0

In [27]:
import numpy as np
import pandas as pd

### Download Titanic dataset
<b>Download link: </b>https://www.kaggle.com/c/titanic/data

In [28]:
titanic = pd.read_csv('data/titanic.csv')

In [29]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic = titanic.drop(columns=['Cabin'])

In [5]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [6]:
np.sum(titanic['Age'].isna())

177

#### Group data by port of embarkation
* C = Cherbourg 
* Q = Queenstown
* S = Southampton

In [8]:
port = titanic.groupby('Embarked').aggregate(np.mean)

In [9]:
port

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Embarked,,,,,,,
C,445.357143,0.553571,1.886905,30.814769,0.386905,0.363095,59.954144
Q,417.896104,0.389610,2.909091,28.089286,0.428571,0.168831,13.276030
S,449.527950,0.336957,2.350932,29.445397,0.571429,0.413043,27.079812

In [10]:
port[['Age','Fare']]

                Age       Fare
Embarked
C         30.814769  59.954144
Q         28.089286  13.276030
S         29.445397  27.079812

<b>How many people survived and what is the percentage?</b>

In [11]:
total = np.count_nonzero(titanic['PassengerId'])

In [12]:
survived = np.count_nonzero(titanic['Survived'])

In [13]:
percent_survived = (survived / total) * 100

In [14]:
print('Total = %i' %total)
print('Survived = %i' %survived)
print('Percentage Survived = %i' %percent_survived)

Total = 891
Survived = 342
Percentage Survived = 38

<b> Female Survivors </b>

In [15]:
females = titanic[titanic['Sex'] == 'female']

In [16]:
females.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,C

In [17]:
females_survived = np.count_nonzero(females['Survived'])

In [18]:
print('Females who Survived = %i' %females_survived)

Females who Survived = 233

<b>Male Survivors</b>

In [19]:
males = titanic[titanic['Sex'] == 'male']

In [20]:
males_survived = np.count_nonzero(males['Survived'])

In [21]:
print('Males who Survived = %i' %males_survived)

Males who Survived = 109

<b> Out of the suvivors how many belonged to a particular passenger class </b>

In [22]:
survivors = titanic[titanic['Survived'] == 1]

In [23]:
Pclass = titanic.groupby('Pclass').aggregate(np.count_nonzero)

In [24]:
Pclass[['Survived']]

        Survived
Pclass
1            136
2             87
3            119

##### Use np.sum() to get total number of survivors
We had earlier used np.count_nonzero() on the Survived column

In [25]:
np.sum(Pclass['Survived'])

342